---
kind: type
id: T:Autodesk.Revit.DB.ConfigurationReloadInfo
source: html/f19d2d1f-191d-ec90-4b07-20c9307bf537.htm
---
# Autodesk.Revit.DB.ConfigurationReloadInfo

This object contains information returned by a reload of the fabrication configuration.

## Syntax (C#)
```csharp
public class ConfigurationReloadInfo : IDisposable
```